app/Http/Controllers/Frontend/HomeController.php

select `A`.`id`, `A`.`code`, `A`.`regular_price`, `A`.`sale_price`, `A`.`link`, `A`.`image`, `A`.`alt`, `A`.`category_id`, `A`.`user_id`, `A`.`type`, `A`.`status`, `B`.`title`, `B`.`slug` from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and FIND_IN_SET('new',A.status) and `A`.`type` = 'san-pham' order by `A`.`priority` asc, `A`.`id` desc limit 10
select `A`.`id`, `A`.`link`, `A`.`image`, `A`.`alt`, `A`.`updated_at`, `B`.`title`, `B`.`slug`, `B`.`description` from `posts` as `A` left join `post_languages` as `B` on `A`.`id` = `B`.`post_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'bo-suu-tap' order by `A`.`priority` asc, `A`.`id` desc limit 8
select `A`.`id`, `A`.`link`, `A`.`image`, `A`.`alt`, `A`.`updated_at`, `B`.`title`, `B`.`slug`, `B`.`description` from `posts` as `A` left join `post_languages` as `B` on `A`.`id` = `B`.`post_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and FIND_IN_SET('new',A.status) and `A`.`type` = 'tin-tuc' order by `A`.`priority` asc, `A`.`id` desc limit 6
---
    public function index(Request $request){
        $this->_data['new_products'] = DB::table('products as A')
            ->leftjoin('product_languages as B', 'A.id', '=', 'B.product_id')
            ->select('A.id','A.code','A.regular_price','A.sale_price','A.link','A.image','A.alt','A.category_id','A.user_id','A.type','A.status','B.title', 'B.slug')
            ->where('B.language',$this->_data['lang'])
            ->whereRaw('FIND_IN_SET(\'publish\',A.status) and FIND_IN_SET(\'new\',A.status)')
            ->where('A.type','san-pham')
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->limit(10)
            ->get();

        $this->_data['single_post'] = get_pages('san-pham-moi');

        $this->_data['collections'] = DB::table('posts as A')
            ->leftjoin('post_languages as B', 'A.id', '=', 'B.post_id')
            ->select('A.id','A.link','A.image','A.alt','A.updated_at','B.title','B.slug','B.description')
            ->where('B.language',$this->_data['lang'])
            ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
            ->where('A.type','bo-suu-tap')
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->limit(8)
            ->get();

        $this->_data['banners'] = get_photos('banner');

        $this->_data['new_posts'] = DB::table('posts as A')
            ->leftjoin('post_languages as B', 'A.id', '=', 'B.post_id')
            ->select('A.id','A.link','A.image','A.alt','A.updated_at','B.title','B.slug','B.description')
            ->where('B.language',$this->_data['lang'])
            ->whereRaw('FIND_IN_SET(\'publish\',A.status) and FIND_IN_SET(\'new\',A.status)')
            ->where('A.type','tin-tuc')
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->limit(6)
            ->get();